use bd_estate_agency_tr
go
drop proc Вычисл_Колличество_квартир_у_дома
go
create proc Вычисл_Колличество_квартир_у_дома
as
delete Количество_квартир 
insert into Количество_квартир (id_дома, кол_кв_у_дома1 , кол_кв_у_дома2 ,кол_кв_у_дома3 ,кол_кв_у_дома4 , кол_кв_у_дома5)
select distinct квартира.дом, 0, 0, 0,0,0
from квартира

declare @дом smallint, @КоличествоКвар int
declare Вычисл_12345 cursor for
select дом,  count(дом) 'Количество_кв_в_домах'
from  квартира
group by дом
open Вычисл_12345
fetch next from Вычисл_12345 into @дом, @КоличествоКвар

while @@fetch_status = 0 begin
if @дом = 13
update Количество_квартир
set кол_кв_у_дома1 = @КоличествоКвар
where id_дома = @дом
if @дом = 14
update Количество_квартир
set кол_кв_у_дома2 = @КоличествоКвар
where id_дома = @дом
if @дом = 15
update Количество_квартир
set кол_кв_у_дома3 = @КоличествоКвар
where id_дома = @дом
if @дом = 17
update Количество_квартир
set кол_кв_у_дома4 = @КоличествоКвар
where id_дома = @дом
fetch next from Вычисл_12345 into @дом, @КоличествоКвар
end
close Вычисл_12345
deallocate Вычисл_12345
go
exec Вычисл_Колличество_квартир_у_дома

select * from Количество_квартир
go
