use bd_estate_agency_tr
go 
select  район,кол_квартир
from(
	select район.название район,COUNT(квартира.id_квартиры) AS "кол_квартир"
	from район,квартира,дом
	where квартира.дом = дом.id_дома and
		  дом.район = район.номер_района
	group by район.название
) AS "результаты"
where результаты.кол_квартир = 
		(
			select MAX(кол_квартир)
			from(
					select район.название,COUNT(квартира.id_квартиры) AS "кол_квартир"
					from район,квартира,дом
					where квартира.дом = дом.id_дома and
							дом.район = район.номер_района
					group by район.название
				) AS "макс"
		)
