use bd_estate_agency_tr
go 
select  район,цена
from(
	select район.название район,MIN(квартира.цена_кв_м) AS "цена"
	from район,квартира,дом
	where квартира.дом = дом.id_дома and
		  дом.район = район.номер_района
	group by район.название
) AS "результаты"
where результаты.цена = 
		(
			select MIN(цена)
			from(
					select район.название город,MIN(квартира.цена_кв_м) AS "цена"
					from район,квартира,дом
					where квартира.дом = дом.id_дома and
						  дом.район = район.номер_района
					group by район.название
				) AS "мин"
		)
